# NumberOfColumns Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTable..::..NumberOfColumns Property
FamilySizeTable Class See Also
---
Number of columns in the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int NumberOfColumns { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfColumns As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfColumns {
	int get ();
}
```

# See Also
FamilySizeTable Class
Autodesk.Revit.DB Namespace